* general emacs behaviour
start the emacs serve at startup of an emacs instance
#+BEGIN_SRC emacs-lisp
(server-start)
#+END_SRC

#+RESULTS:

customize annoyng defaults
#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
(global-auto-revert-mode 1)
(setq inhibit-startup-message t)

(scroll-bar-mode 0)
(tool-bar-mode 0)
(menu-bar-mode 0)

(savehist-mode 1)
(show-paren-mode 1)
(setq show-paren-delay 0)

(blink-cursor-mode 0)
;; kill selected region at yank
(delete-selection-mode 1)  

(setq delete-by-moving-to-trash t)
#+END_SRC

#+RESULTS:
: t

Disable startup screen when opening a file from command line
#+BEGIN_SRC emacs-lisp
(defun my-inhibit-startup-screen-always ()
  ;; Startup screen inhibitor for `command-line-functions`.
  ;; Inhibits startup screen on the first unrecognised option.
  (ignore (setq inhibit-startup-screen t)))

(add-hook 'command-line-functions #'my-inhibit-startup-screen-always)
#+END_SRC

Set scrolling behaviour (that is almost like smooth-scrolling)
#+BEGIN_SRC emacs-lisp
  (setq scroll-step 1)
  (setq scroll-conservatively 10000)
  (setq auto-window-vscroll nil)
  (setq scroll-margin 2)
#+END_SRC

#+RESULTS:
: 2

Set scrolling behaviour for mouse (it's choppy otherwise)

#+BEGIN_SRC emacs-lisp
  (when (display-graphic-p)
    (setq mouse-wheel-scroll-amount '(1
                                      ((shift) . 1))
          mouse-wheel-progressive-speed
          nil))

  (setq scroll-step 1
        scroll-margin 0
        scroll-conservatively 100000)
#+END_SRC

#+RESULTS:
: 100000

Pixel scrolling
#+BEGIN_SRC emacs-lisp
  ;;; Scrolling.
  ;; Good speed and allow scrolling through large images (pixel-scroll).
  ;; Note: Scroll lags when point must be moved but increasing the number
  ;;       of lines that point moves in pixel-scroll.el ruins large image
  ;;       scrolling. So unfortunately I think we'll just have to live with
  ;;       this.
  ;; (pixel-scroll-mode)
  ;; (setq pixel-dead-time 0) ; Never go back to the old scrolling behaviour.
  ;; (setq pixel-resolution-fine-flag t) ; Scroll by number of pixels instead of lines (t = frame-char-height pixels).
  ;; (setq mouse-wheel-scroll-amount '(1)) ; Distance in pixel-resolution to scroll each mouse wheel event.
  ;; (setq mouse-wheel-progressive-speed nil) ; Progressive speed is too fast for me.

#+END_SRC

#+RESULTS:


Place auto-save files into seperate directory, away from the original files, to not have them be unintentionally stored in e.g. a git commit
#+BEGIN_SRC emacs-lisp
  (let (my-backup-folder)
    (setq my-backup-folder (concat user-emacs-directory ".saves"))
    (if (not (file-exists-p my-backup-folder))
        (make-directory my-backup-folder))

    (setq backup-directory-alist (quote (("." . "~/.saves"))))
    ;; (setq backup-directory-alist `(("." . ,my-backup-folder)))
    (setq backup-by-copying t))
#+END_SRC

#+RESULTS:
: t

Quick up and down navigation
#+BEGIN_SRC emacs-lisp
;; replaces forward-sentence
(global-set-key (kbd "M-e")
  (lambda ()
    (interactive)
    (setq this-command 'next-line)
    (next-line 3)))

;; replaces backward-sentence
(global-set-key (kbd "M-a")
  (lambda ()
    (interactive)
    (setq this-command 'previous-line)
    (previous-line 3)))
#+END_SRC
* Programming general behaviour
#+BEGIN_SRC emacs-lisp
  ;; automatically indent when press RET
  (global-set-key (kbd "RET") 'newline-and-indent)

  ;; activate whitespace-mode to view all whitespace characters
  (global-set-key (kbd "C-c w") 'whitespace-mode)

  ;; show unncessary whitespace that can mess up your diff
  ;; (add-hook 'prog-mode-hook
  ;;           (lambda ()
  ;;             (interactive)
  ;;             (setq show-trailing-whitespace 1)))

  ;; use space to indent by default
  (setq-default indent-tabs-mode nil)

  ;; set appearance of a tab that is represented by 4 spaces
  (setq-default tab-width 4)

  ;; navigate through matches in list (may it be compilation messages or tag occurrences)
  (global-set-key (kbd "C-, k") (lambda () (interactive) (next-match -1)))
  (global-set-key (kbd "C-, j") (lambda () (interactive) (next-match +1)))

  (add-hook 'prog-mode-hook 'visual-line-mode)
#+END_SRC

#+RESULTS:
| visual-line-mode | (lambda nil (interactive) (setq show-trailing-whitespace 1)) |

** python
#+BEGIN_SRC emacs-lisp
  (defun printbreakpoint ()
    (interactive)
    (insert "import ipdb; ipdb.set_trace()  # noqa BREAKPOINT"))

  (add-hook 'python-mode-hook
            (lambda ()
              (define-key python-mode-map (kbd "C-, b") 'printbreakpoint)))
#+END_SRC

#+RESULTS:
| anaconda-eldoc-mode | anaconda-mode | origami-mode | (lambda nil (interactive) (define-key python-mode-map (kbd C-)) (quote sp-forward-slurp-sexp)) (define-key python-mode-map (kbd C-}) (quote sp-forward-barf-sexp)) (define-key python-mode-map (kbd <M-up>) (quote sp-splice-sexp-killing-backward))) | (lambda nil (define-key python-mode-map (kbd C-, b) (quote printbreakpoint))) |

** latex
#+BEGIN_SRC emacs-lisp
(add-hook 'LaTeX-mode-hook 'show-paren-mode)
(add-hook 'LaTeX-mode-hook 'visual-line-mode)
#+END_SRC

#+RESULTS:
| visual-line-mode | show-paren-mode | preview-mode-setup | asy-insinuate-latex-maybe |

